anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR32F02/MDR32F02_rev2.svd
<?xml version='1.0' encoding='utf-8' standalone='no'?>
<device schemaVersion="1.1"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>MDR32F02</name>
    <version>1.5.0</version>
    <description>MDR32F02. Rev. 2</description>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>0x20</size>
    <cpu>
        <name>BM-310S</name>
        <endian>little</endian>
    </cpu>
    <peripherals>
        <peripheral>
            <name>CLINT</name>
            <description>Сore Local Interrupt Controller</description>
            <groupName>CLINT</groupName>
            <baseAddress>0x02000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTMSIP</name>
                    <displayName>CTMSIP</displayName>
                    <description>Software Interrupt Request/Clear Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CTMTIMECMP</name>
                    <displayName>CTMTIMECMP</displayName>
                    <description>Machine Timer Compare Register</description>
                    <addressOffset>0x00004000</addressOffset>
                    <size>0x40</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CTMTIME</name>
                    <displayName>CTMTIME</displayName>
                    <description>Machine Timer Value Register</description>
                    <addressOffset>0x0000BFF8</addressOffset>
                    <size>0x40</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PLIC</name>
            <description>Platform Level Interrupt Controller</description>
            <groupName>PLIC</groupName>
            <baseAddress>0x0C000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PRI1</name>
                    <displayName>PRI1</displayName>
                    <description>1st Interrupt Priority Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>Interrupt Priority</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI2</name>
                    <displayName>PRI2</displayName>
                    <description>2nd Interrupt Priority Register</description>
                    <addressOffset>0x00000008</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <displayName>PRI3</displayName>
                    <description>3rd Interrupt Priority Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI4</name>
                    <displayName>PRI4</displayName>
                    <description>4th Interrupt Priority Register</description>
                    <addressOffset>0x00000010</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI5</name>
                    <displayName>PRI5</displayName>
                    <description>5th Interrupt Priority Register</description>
                    <addressOffset>0x00000014</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI6</name>
                    <displayName>PRI6</displayName>
                    <description>6th Interrupt Priority Register</description>
                    <addressOffset>0x00000018</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI7</name>
                    <displayName>PRI7</displayName>
                    <description>7th Interrupt Priority Register</description>
                    <addressOffset>0x0000001C</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI8</name>
                    <displayName>PRI8</displayName>
                    <description>8th Interrupt Priority Register</description>
                    <addressOffset>0x00000020</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI9</name>
                    <displayName>PRI9</displayName>
                    <description>9th Interrupt Priority Register</description>
                    <addressOffset>0x00000024</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI10</name>
                    <displayName>PRI10</displayName>
                    <description>10th Interrupt Priority Register</description>
                    <addressOffset>0x00000028</addressOffset>
                </register>
