anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR32F02/MDR32F02_rev2.svd
                <register derivedFrom="PRI1">
                    <name>PRI31</name>
                    <displayName>PRI31</displayName>
                    <description>31st Interrupt Priority Register</description>
                    <addressOffset>0x0000007C</addressOffset>
                </register>
                <register>
                    <name>IPM</name>
                    <displayName>IPM</displayName>
                    <description>Interrupt Presence Mask Register</description>
                    <addressOffset>0x00001000</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>IPM0</name>
                            <description>IPM0, always 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM1</name>
                            <description>1st Interrupt Pending</description>
                            <bitOffset>1</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM2</name>
                            <description>2nd Interrupt Pending</description>
                            <bitOffset>2</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM3</name>
                            <description>3rd Interrupt Pending</description>
                            <bitOffset>3</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM4</name>
                            <description>4th Interrupt Pending</description>
                            <bitOffset>4</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM5</name>
                            <description>5th Interrupt Pending</description>
                            <bitOffset>5</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM6</name>
                            <description>6th Interrupt Pending</description>
                            <bitOffset>6</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM7</name>
                            <description>7th Interrupt Pending</description>
                            <bitOffset>7</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM8</name>
                            <description>8th Interrupt Pending</description>
                            <bitOffset>8</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM9</name>
                            <description>9th Interrupt Pending</description>
                            <bitOffset>9</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM10</name>
                            <description>10th Interrupt Pending</description>
                            <bitOffset>10</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM11</name>
                            <description>11th Interrupt Pending</description>
                            <bitOffset>11</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM12</name>
                            <description>12th Interrupt Pending</description>
                            <bitOffset>12</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM13</name>
                            <description>13th Interrupt Pending</description>
                            <bitOffset>13</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM14</name>
                            <description>14th Interrupt Pending</description>
                            <bitOffset>14</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM15</name>
                            <description>15th Interrupt Pending</description>
                            <bitOffset>15</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM16</name>
                            <description>16th Interrupt Pending</description>
                            <bitOffset>16</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM17</name>
                            <description>17th Interrupt Pending</description>
                            <bitOffset>17</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM18</name>
                            <description>18th Interrupt Pending</description>
                            <bitOffset>18</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM19</name>
                            <description>19th Interrupt Pending</description>
                            <bitOffset>19</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM20</name>
                            <description>20th Interrupt Pending</description>
                            <bitOffset>20</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM21</name>
                            <description>21st Interrupt Pending</description>
                            <bitOffset>21</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM22</name>
                            <description>22nd Interrupt Pending</description>
                            <bitOffset>22</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM23</name>
                            <description>23rd Interrupt Pending</description>
                            <bitOffset>23</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM24</name>
                            <description>24th Interrupt Pending</description>
                            <bitOffset>24</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM25</name>
                            <description>25th Interrupt Pending</description>
                            <bitOffset>25</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM26</name>
                            <description>26th Interrupt Pending</description>
                            <bitOffset>26</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM27</name>
                            <description>27th Interrupt Pending</description>
                            <bitOffset>27</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM28</name>
                            <description>28th Interrupt Pending</description>
                            <bitOffset>28</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM29</name>
                            <description>29th Interrupt Pending</description>
                            <bitOffset>29</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM30</name>
                            <description>30th Interrupt Pending</description>
                            <bitOffset>30</bitOffset>
                        </field>
                        <field derivedFrom="IPM0">
                            <name>IPM31</name>
                            <description>31st Interrupt Pending</description>
                            <bitOffset>31</bitOffset>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IEM</name>
                    <displayName>IEM</displayName>
                    <description>Interrupt Enable Mask Register</description>
                    <addressOffset>0x00002000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IEM0</name>
                            <description>IEM0, always 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM1</name>
                            <description>1st Interrupt Enable Mask</description>
                            <bitOffset>1</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM2</name>
                            <description>2nd Interrupt Enable Mask</description>
                            <bitOffset>2</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM3</name>
                            <description>3rd Interrupt Enable Mask</description>
                            <bitOffset>3</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM4</name>
                            <description>4th Interrupt Enable Mask</description>
                            <bitOffset>4</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM5</name>
                            <description>5th Interrupt Enable Mask</description>
                            <bitOffset>5</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM6</name>
                            <description>6th Interrupt Enable Mask</description>
                            <bitOffset>6</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM7</name>
                            <description>7th Interrupt Enable Mask</description>
                            <bitOffset>7</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM8</name>
                            <description>8th Interrupt Enable Mask</description>
                            <bitOffset>8</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM9</name>
                            <description>9th Interrupt Enable Mask</description>
                            <bitOffset>9</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM10</name>
                            <description>10th Interrupt Enable Mask</description>
                            <bitOffset>10</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM11</name>
                            <description>11th Interrupt Enable Mask</description>
                            <bitOffset>11</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM12</name>
                            <description>12th Interrupt Enable Mask</description>
                            <bitOffset>12</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM13</name>
                            <description>13th Interrupt Enable Mask</description>
                            <bitOffset>13</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM14</name>
                            <description>14th Interrupt Enable Mask</description>
                            <bitOffset>14</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM15</name>
                            <description>15th Interrupt Enable Mask</description>
                            <bitOffset>15</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM16</name>
                            <description>16th Interrupt Enable Mask</description>
                            <bitOffset>16</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM17</name>
                            <description>17th Interrupt Enable Mask</description>
                            <bitOffset>17</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM18</name>
                            <description>18th Interrupt Enable Mask</description>
                            <bitOffset>18</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM19</name>
                            <description>19th Interrupt Enable Mask</description>
                            <bitOffset>19</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM20</name>
                            <description>20th Interrupt Enable Mask</description>
                            <bitOffset>20</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM21</name>
                            <description>21st Interrupt Enable Mask</description>
                            <bitOffset>21</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM22</name>
                            <description>22nd Interrupt Enable Mask</description>
                            <bitOffset>22</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM23</name>
                            <description>23rd Interrupt Enable Mask</description>
                            <bitOffset>23</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM24</name>
                            <description>24th Interrupt Enable Mask</description>
                            <bitOffset>24</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM25</name>
                            <description>25th Interrupt Enable Mask</description>
                            <bitOffset>25</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM26</name>
                            <description>26th Interrupt Enable Mask</description>
                            <bitOffset>26</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM27</name>
                            <description>27th Interrupt Enable Mask</description>
                            <bitOffset>27</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM28</name>
                            <description>28th Interrupt Enable Mask</description>
                            <bitOffset>28</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM29</name>
                            <description>29th Interrupt Enable Mask</description>
                            <bitOffset>29</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM30</name>
                            <description>30th Interrupt Enable Mask</description>
                            <bitOffset>30</bitOffset>
                        </field>
                        <field derivedFrom="IEM0">
                            <name>IEM31</name>
                            <description>31st Interrupt Enable Mask</description>
                            <bitOffset>31</bitOffset>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>THR</name>
                    <displayName>THR</displayName>
                    <description>Interrupt Priority Threshold Register</description>
                    <addressOffset>0x00200000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>THR</name>
                            <description>Threshold level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
