anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR32F02/MDR32F02_rev2.svd
                <register>
                    <name>ICC</name>
                    <displayName>ICC</displayName>
                    <description>Interrupt Claiming/Completion Register</description>
                    <addressOffset>0x00200004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ICC0</name>
                            <description>ICC0, always 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC1</name>
                            <description>1st Interrupt Claiming/Completion</description>
                            <bitOffset>1</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC2</name>
                            <description>2nd Interrupt Claiming/Completion</description>
                            <bitOffset>2</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC3</name>
                            <description>3rd Interrupt Claiming/Completion</description>
                            <bitOffset>3</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC4</name>
                            <description>4th Interrupt Claiming/Completion</description>
                            <bitOffset>4</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC5</name>
                            <description>5th Interrupt Claiming/Completion</description>
                            <bitOffset>5</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC6</name>
                            <description>6th Interrupt Claiming/Completion</description>
                            <bitOffset>6</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC7</name>
                            <description>7th Interrupt Claiming/Completion</description>
                            <bitOffset>7</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC8</name>
                            <description>8th Interrupt Claiming/Completion</description>
                            <bitOffset>8</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC9</name>
                            <description>9th Interrupt Claiming/Completion</description>
                            <bitOffset>9</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC10</name>
                            <description>10th Interrupt Claiming/Completion</description>
                            <bitOffset>10</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC11</name>
                            <description>11th Interrupt Claiming/Completion</description>
                            <bitOffset>11</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC12</name>
                            <description>12th Interrupt Claiming/Completion</description>
                            <bitOffset>12</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC13</name>
                            <description>13th Interrupt Claiming/Completion</description>
                            <bitOffset>13</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC14</name>
                            <description>14th Interrupt Claiming/Completion</description>
                            <bitOffset>14</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC15</name>
                            <description>15th Interrupt Claiming/Completion</description>
                            <bitOffset>15</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC16</name>
                            <description>16th Interrupt Claiming/Completion</description>
                            <bitOffset>16</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC17</name>
                            <description>17th Interrupt Claiming/Completion</description>
                            <bitOffset>17</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC18</name>
                            <description>18th Interrupt Claiming/Completion</description>
                            <bitOffset>18</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC19</name>
                            <description>19th Interrupt Claiming/Completion</description>
                            <bitOffset>19</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC20</name>
                            <description>20th Interrupt Claiming/Completion</description>
                            <bitOffset>20</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC21</name>
                            <description>21st Interrupt Claiming/Completion</description>
                            <bitOffset>21</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC22</name>
                            <description>22nd Interrupt Claiming/Completion</description>
                            <bitOffset>22</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC23</name>
                            <description>23rd Interrupt Claiming/Completion</description>
                            <bitOffset>23</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC24</name>
                            <description>24th Interrupt Claiming/Completion</description>
                            <bitOffset>24</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC25</name>
                            <description>25th Interrupt Claiming/Completion</description>
                            <bitOffset>25</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC26</name>
                            <description>26th Interrupt Claiming/Completion</description>
                            <bitOffset>26</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC27</name>
                            <description>27th Interrupt Claiming/Completion</description>
                            <bitOffset>27</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC28</name>
                            <description>28th Interrupt Claiming/Completion</description>
                            <bitOffset>28</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC29</name>
                            <description>29th Interrupt Claiming/Completion</description>
                            <bitOffset>29</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC30</name>
                            <description>30th Interrupt Claiming/Completion</description>
                            <bitOffset>30</bitOffset>
                        </field>
                        <field derivedFrom="ICC0">
                            <name>ICC31</name>
                            <description>31st Interrupt Claiming/Completion</description>
                            <bitOffset>31</bitOffset>
                        </field>
                    </fields>
                </register>
