anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR32F02/MDR32F02_rev2.svd
                <register>
                    <name>CHNL_REQ_MASK_CLR</name>
                    <displayName>CHNL_REQ_MASK_CLR</displayName>
                    <description>CHNL_REQ_MASK_CLR description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_0</name>
                            <description>CHNL_REQ_MASK_CLR_0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_1</name>
                            <description>CHNL_REQ_MASK_CLR_1 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_2</name>
                            <description>CHNL_REQ_MASK_CLR_2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_3</name>
                            <description>CHNL_REQ_MASK_CLR_3 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_4</name>
                            <description>CHNL_REQ_MASK_CLR_4 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_5</name>
                            <description>CHNL_REQ_MASK_CLR_5 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_6</name>
                            <description>CHNL_REQ_MASK_CLR_6 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_7</name>
                            <description>CHNL_REQ_MASK_CLR_7 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_8</name>
                            <description>CHNL_REQ_MASK_CLR_8 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_9</name>
                            <description>CHNL_REQ_MASK_CLR_9 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_10</name>
                            <description>CHNL_REQ_MASK_CLR_10 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_11</name>
                            <description>CHNL_REQ_MASK_CLR_11 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_12</name>
                            <description>CHNL_REQ_MASK_CLR_12 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_13</name>
                            <description>CHNL_REQ_MASK_CLR_13 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_14</name>
                            <description>CHNL_REQ_MASK_CLR_14 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_15</name>
                            <description>CHNL_REQ_MASK_CLR_15 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_16</name>
                            <description>CHNL_REQ_MASK_CLR_16 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_17</name>
                            <description>CHNL_REQ_MASK_CLR_17 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_18</name>
                            <description>CHNL_REQ_MASK_CLR_18 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_19</name>
                            <description>CHNL_REQ_MASK_CLR_19 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_20</name>
                            <description>CHNL_REQ_MASK_CLR_20 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_21</name>
                            <description>CHNL_REQ_MASK_CLR_21 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_22</name>
                            <description>CHNL_REQ_MASK_CLR_22 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_23</name>
                            <description>CHNL_REQ_MASK_CLR_23 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_24</name>
                            <description>CHNL_REQ_MASK_CLR_24 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_25</name>
                            <description>CHNL_REQ_MASK_CLR_25 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_26</name>
                            <description>CHNL_REQ_MASK_CLR_26 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_27</name>
                            <description>CHNL_REQ_MASK_CLR_27 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_28</name>
                            <description>CHNL_REQ_MASK_CLR_28 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_29</name>
                            <description>CHNL_REQ_MASK_CLR_29 description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_30</name>
                            <description>CHNL_REQ_MASK_CLR_30 description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHNL_REQ_MASK_CLR_31</name>
                            <description>CHNL_REQ_MASK_CLR_31 description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHNL_ENABLE_SET</name>
                    <displayName>CHNL_ENABLE_SET</displayName>
                    <description>CHNL_ENABLE_SET description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CHNL_ENABLE_SET_0</name>
                            <description>CHNL_ENABLE_SET_0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_1</name>
                            <description>CHNL_ENABLE_SET_1 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_2</name>
                            <description>CHNL_ENABLE_SET_2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_3</name>
                            <description>CHNL_ENABLE_SET_3 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_4</name>
                            <description>CHNL_ENABLE_SET_4 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_5</name>
                            <description>CHNL_ENABLE_SET_5 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_6</name>
                            <description>CHNL_ENABLE_SET_6 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_7</name>
                            <description>CHNL_ENABLE_SET_7 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_8</name>
                            <description>CHNL_ENABLE_SET_8 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_9</name>
                            <description>CHNL_ENABLE_SET_9 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_10</name>
                            <description>CHNL_ENABLE_SET_10 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_11</name>
                            <description>CHNL_ENABLE_SET_11 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_12</name>
                            <description>CHNL_ENABLE_SET_12 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_13</name>
                            <description>CHNL_ENABLE_SET_13 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_14</name>
                            <description>CHNL_ENABLE_SET_14 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_15</name>
                            <description>CHNL_ENABLE_SET_15 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_16</name>
                            <description>CHNL_ENABLE_SET_16 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_17</name>
                            <description>CHNL_ENABLE_SET_17 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_18</name>
                            <description>CHNL_ENABLE_SET_18 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_19</name>
                            <description>CHNL_ENABLE_SET_19 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_20</name>
                            <description>CHNL_ENABLE_SET_20 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_21</name>
                            <description>CHNL_ENABLE_SET_21 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_22</name>
                            <description>CHNL_ENABLE_SET_22 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_23</name>
                            <description>CHNL_ENABLE_SET_23 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_24</name>
                            <description>CHNL_ENABLE_SET_24 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_25</name>
                            <description>CHNL_ENABLE_SET_25 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_26</name>
                            <description>CHNL_ENABLE_SET_26 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_27</name>
                            <description>CHNL_ENABLE_SET_27 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_28</name>
                            <description>CHNL_ENABLE_SET_28 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_29</name>
                            <description>CHNL_ENABLE_SET_29 description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_30</name>
                            <description>CHNL_ENABLE_SET_30 description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHNL_ENABLE_SET_31</name>
                            <description>CHNL_ENABLE_SET_31 description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
