anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR32F02/MDR32F02_rev2.svd
                <register>
                    <name>F2MD0</name>
                    <displayName>F2MD0</displayName>
                    <description>F2MD0 description</description>
                    <addressOffset>0x000000E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2PER_FREQ</name>
                            <description>F2PER_FREQ description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>21</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>V2GAIN</name>
                            <description>V2GAIN description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2GAIN</name>
                            <description>I2GAIN description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2REACTS</name>
                            <description>F2REACTS description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2ACTS</name>
                            <description>F2ACTS description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2ISEL</name>
                            <description>F2ISEL description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>F2VSEL</name>
                            <description>F2VSEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2MD1</name>
                    <displayName>F2MD1</displayName>
                    <description>F2MD1 description</description>
                    <addressOffset>0x000000E4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VPKLVL</name>
                            <description>F2VPKLVL description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>F2IPKLVL</name>
                            <description>F2IPKLVL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2MD2</name>
                    <displayName>F2MD2</displayName>
                    <description>F2MD2 description</description>
                    <addressOffset>0x000000E8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2PHASE</name>
                            <description>F2PHASE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VPEAK</name>
                    <displayName>F2VPEAK</displayName>
                    <description>F2VPEAK description</description>
                    <addressOffset>0x000000EC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VPEAK</name>
                            <description>F2VPEAK description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2IPEAK</name>
                    <displayName>F2IPEAK</displayName>
                    <description>F2IPEAK description</description>
                    <addressOffset>0x000000F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2IPEAK</name>
                            <description>F2IPEAK description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VDAT</name>
                    <displayName>F2VDAT</displayName>
                    <description>F2VDAT description</description>
                    <addressOffset>0x000000F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VDAT</name>
                            <description>F2VDAT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2IDAT</name>
                    <displayName>F2IDAT</displayName>
                    <description>F2IDAT description</description>
                    <addressOffset>0x000000F8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2IDAT</name>
                            <description>F2IDAT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VRMS</name>
                    <displayName>F2VRMS</displayName>
                    <description>F2VRMS description</description>
                    <addressOffset>0x000000FC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VRMS</name>
                            <description>F2VRMS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VRMS2</name>
                    <displayName>F2VRMS2</displayName>
                    <description>F2VRMS2 description</description>
                    <addressOffset>0x00000100</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2IRMS</name>
                    <displayName>F2IRMS</displayName>
                    <description>F2IRMS description</description>
                    <addressOffset>0x00000104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2IRMS</name>
                            <description>F2IRMS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2IRMS2</name>
                    <displayName>F2IRMS2</displayName>
                    <description>F2IRMS2 description</description>
                    <addressOffset>0x00000108</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2STAT</name>
                    <displayName>F2STAT</displayName>
                    <description>F2STAT description</description>
                    <addressOffset>0x0000010C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAROVN</name>
                            <description>F2VAROVN description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVN</name>
                            <description>F2WATTOVN description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZEROCRS</name>
                            <description>F2ZEROCRS description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VANLDFL</name>
                            <description>F2VANLDFL description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VARNLDFL</name>
                            <description>F2VARNLDFL description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VARSIGN</name>
                            <description>F2VARSIGN description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APNLDFL</name>
                            <description>F2APNLDFL description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2APSIGN</name>
                            <description>F2APSIGN description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZXTOF</name>
                            <description>F2ZXTOF description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAOV</name>
                            <description>F2VAOV description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAROVP</name>
                            <description>F2VAROVP description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVP</name>
                            <description>F2WATTOVP description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKIF</name>
                            <description>F2PEAKIF description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKVF</name>
                            <description>F2PEAKVF description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2SAGF</name>
                            <description>F2SAGF description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_OVR</name>
                            <description>F2IF_OVR description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_FLL</name>
                            <description>F2IF_FLL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2IF_EMP</name>
                            <description>F2IF_EMP description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VF_OVR</name>
                            <description>F2VF_OVR description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_FLL</name>
                            <description>F2VF_FLL description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VF_EMP</name>
                            <description>F2VF_EMP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2MASK</name>
                    <displayName>F2MASK</displayName>
                    <description>F2MASK description</description>
                    <addressOffset>0x00000110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAROVNM</name>
                            <description>F2VAROVNM description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVNM</name>
                            <description>F2WATTOVNM description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZEROCRSM</name>
                            <description>F2ZEROCRSM description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VANLDFLM</name>
                            <description>F2VANLDFLM description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VARNLDFLM</name>
                            <description>F2VARNLDFLM description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VARSIGNM</name>
                            <description>F2VARSIGNM description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APNLDFLM</name>
                            <description>F2APNLDFLM description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APSIGNM</name>
                            <description>F2APSIGNM description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZXTOFM</name>
                            <description>F2ZXTOFM description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAOVM</name>
                            <description>F2VAOVM description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAROVPM</name>
                            <description>F2VAROVPM description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVPM</name>
                            <description>F2WATTOVPM description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKIFM</name>
                            <description>F2PEAKIFM description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKVFM</name>
                            <description>F2PEAKVFM description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2SAGFM</name>
                            <description>F2SAGFM description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_OVRM</name>
                            <description>F2IF_OVRM description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_FLLM</name>
                            <description>F2IF_FLLM description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_EMPM</name>
                            <description>F2IF_EMPM description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_OVRM</name>
                            <description>F2VF_OVRM description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_FLLM</name>
                            <description>F2VF_FLLM description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_EMPM</name>
                            <description>F2VF_EMPM description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
