anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR32F02/MDR32F02_rev2.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>P_BIT0</name>
            <description>P_BIT0 description</description>
            <groupName>P_BIT</groupName>
            <baseAddress>0x6002C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TRANSFORM_0</name>
                    <displayName>TRANSFORM_0</displayName>
                    <description>Transformation Register 1</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_1</name>
                    <displayName>TRANSFORM_1</displayName>
                    <description>Transformation Register 2</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_2</name>
                    <displayName>TRANSFORM_2</displayName>
                    <description>Transformation Register 3</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_3</name>
                    <displayName>TRANSFORM_3</displayName>
                    <description>Transformation Register 4</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MUX_SET</name>
                    <displayName>MUX_SET</displayName>
                    <description>Transformation setup register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IN_SEL</name>
                            <description>IN_SEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OUT_SEL</name>
                            <description>OUT_SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUX_VAL</name>
                    <displayName>MUX_VAL</displayName>
                    <description>Transformation value register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>VAL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="P_BIT0">
            <name>P_BIT1</name>
            <description>P_BIT1 description</description>
            <groupName>P_BIT</groupName>
            <baseAddress>0x60030000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="P_BIT0">
            <name>P_BIT2</name>
            <description>P_BIT2 description</description>
            <groupName>P_BIT</groupName>
            <baseAddress>0x60034000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="P_BIT0">
            <name>P_BIT3</name>
            <description>P_BIT3 description</description>
            <groupName>P_BIT</groupName>
            <baseAddress>0x60038000</baseAddress>
        </peripheral>
        <peripheral>
            <name>OTP</name>
            <description>OTP description</description>
            <groupName>OTP</groupName>
            <baseAddress>0x70010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>OTP_IRQ</name>
                <value>22</value>
            </interrupt>
            <registers>
                <register>
                    <name>STAT_CTRL</name>
                    <displayName>STAT_CTRL</displayName>
                    <description>Status and Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>FSM_STATE</name>
                            <description>Common module controller FSM state</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>OTP busy flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OTP_LOCK</name>
                            <description>OTP write lock flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OTP_PLOCK</name>
                            <description>OPT partial write lock flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RW_ERROR</name>
                            <description>Read or write error flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEST_CRC</name>
                            <description>TEST_OPT register CRC valid</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PCRC</name>
                            <description>WRITE_PROTECT register CRC valid</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PCRC</name>
                            <description>READ_PROTECT register CRC valid</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIR_EN</name>
                            <description>Direct control enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Blocks Status Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>OTP_FSM_STATE</name>
                            <description>OTP block FSM state</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>OTP_LOCK</name>
                            <description>OTP write lock state</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OTP_BUSY</name>
                            <description>OTP busy flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DELAY_0</name>
                    <displayName>DELAY_0</displayName>
                    <description>Delay Register 0</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DELAY_20NS</name>
                            <description>Delay parameter for generating a pause of 20 ns</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DELAY_70NS</name>
                            <description>Delay parameter for generating a pause of 70 ns</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DELAY_50NS</name>
                            <description>Delay parameter for generating a pause of 50 ns</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DELAY_01US</name>
                            <description>Delay parameter for generating a pause of 1 us</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DELAY_1</name>
                    <displayName>DELAY_1</displayName>
                    <description>Delay 1 Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DELAY_16US</name>
                            <description>Delay parameter for generating a pause of 16 us</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RW_CMD</name>
                    <displayName>RW_CMD</displayName>
                    <description>Read/Write Command Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Bit address for write and read operations</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                        <field>
                            <name>DATA</name>
                            <description>Data for writing in OTP</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ</name>
                            <description>Command to read from the specified address</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE</name>
                            <description>Command to write to the specified address</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RW_ERROR</name>
                            <description>Last read/write operation error</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>READ_DATA</name>
                    <displayName>READ_DATA</displayName>
                    <description>Read Data Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data read from OTP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRITE_PROTECT</name>
                    <displayName>WRITE_PROTECT</displayName>
                    <description>Write Protection Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-writeOnce</access>
                    <fields>
                        <field>
                            <name>WRITE_PROTECT[0]</name>
                            <description></description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PROTECT[1]</name>
                            <description></description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PROTECT[2]</name>
                            <description></description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PROTECT[3]</name>
                            <description></description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PROTECT[4]</name>
                            <description></description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PROTECT[5]</name>
                            <description></description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PROTECT[6]</name>
                            <description></description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRITE_PROTECT[7]</name>
                            <description></description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>READ_PROTECT</name>
                    <displayName>READ_PROTECT</displayName>
                    <description>Read protection register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-writeOnce</access>
                    <fields>
                        <field>
                            <name>READ_PROTECT[0]</name>
                            <description></description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PROTECT[1]</name>
                            <description></description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PROTECT[2]</name>
                            <description></description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PROTECT[3]</name>
                            <description></description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PROTECT[4]</name>
                            <description></description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PROTECT[5]</name>
                            <description></description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PROTECT[6]</name>
                            <description></description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READ_PROTECT[7]</name>
                            <description></description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEST_OPT</name>
                    <displayName>TEST_OPT</displayName>
                    <description>Test Options Register</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DEBUG[0]</name>
                            <description></description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG[1]</name>
                            <description></description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG[2]</name>
                            <description></description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG[3]</name>
                            <description></description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG[4]</name>
                            <description></description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG[5]</name>
                            <description></description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG[6]</name>
                            <description></description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBUG[7]</name>
                            <description></description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>

